import re
from collections import Counter


def same_words(text):
    words = re.findall(r'\b\w+\b', text.upper())
    return Counter(words).most_common(10)


text = ("История искусственного интеллекта как нового научного направления начинается в середине XX века."
        " К этому времени уже было сформировано множество предпосылок его зарождения: среди философов давно шли споры о"
        " природе человека и процессе познания мира, нейрофизиологи и психологи разработали ряд теорий относительно работы"
        " человеческого мозга и мышления, экономисты и математики задавались вопросами оптимальных расчётов и представления "
        "знаний о мире в формализованном виде; наконец, зародился фундамент математической теории вычислений — теории "
        "алгоритмов — и были созданы первые компьютеры.")
print(same_words(text))

# спасибо Дзен, за Косого с косой))
